package Seminars.Seminar3;

public class Program {

    /*
     * 
    Написать программу на языке Java, в которой идёт со следующими геометрическими фигурами:
    1.Треугольник
    2.Квадрат
    3.Прямоугольник.
    В программе имеется массив фигур, с которым можно сделать следующие операции:
    1.Добавить новую фигуру
    2.Посчитать периметр у всех фигур
    3.Посчитать площадь у всех фигур
    Для фигуры использовать базовый абстрактный класс фигуры, у которого есть методы посчитать периметр и посчитать площадь фигуры. 
    Массив фигур в программе должен быть представлен как массив объектов этого базового класса. Массив фигур должен создаваться и вся работа с ним идёт внутри main. 
    При создании фигур необходимо осуществлять проверку входных данных на возможность создания данной фигуры и в случае ошибки выдавать соответствующие сообщения.
     */
    

     /*
      * На языке программирования Java реализовать классы следующих геометрических фигур:
        1.Треугольник
        2.Прямоугольник
        3.Квадрат
        4.Круг
        У каждой из этих фигур реализовать методы вычисления периметра и площади этих фигур. 
        Так же для каждой фигуры реализовать проверку на корректность данных при создании фигуры, 
        то есть можем ли мы начертить такой треугольник с заданными стонами или квадрат или прямоугольник. 
        Так же круг может существовать только с радиусом больше нуля. Использовать эти классы в main и проверить все методы и конструкторы классов.
      */
}
